Repository: Carlosjc97/aelion
Catalog: lib/l10n/app_*.arb
Languages: es

# loginTitle
source: Learn faster with AI
es: Aprende mas rapido con IA

# loginSubtitle
source: Your learning path in a few taps
es: Tu ruta de aprendizaje en pocos toques

# loginHighlightPersonalized
source: Personalized outlines in minutes
es: Esquemas personalizados en minutos

# loginHighlightStreak
source: Daily streaks keep you motivated
es: Rachas diarias para motivarte

# loginHighlightSync
source: Sync across web and Android with your Google account
es: Sincroniza en web y Android con tu cuenta Google

# loginButton
source: Sign in with Google
es: Iniciar sesion con Google

# loginLoading
source: Connecting...
es: Conectando...

# loginCancelled
source: Sign-in cancelled by the user
es: Inicio cancelado por el usuario

# loginError
source: We could not complete the sign-in. Try again.
es: No pudimos completar el inicio de sesion. Intenta de nuevo.

# authCheckingSession
source: Checking your session...
es: Verificando tu sesion...

# authError
source: We could not verify your session
es: No fue posible validar la sesion

# authRetry
source: Try again
es: Reintentar

# homeGreeting
source: What do you want to learn today?
es: Que quieres aprender hoy?

# homeGreetingNamedShort
source: Hi {name}
es: Hola {name}

# homeGreetingWave
source: Hello
es: Hola

# homeTitle
source: Home
es: Inicio

# homeMotivation
source: Let's keep your learning streak going today.
es: Sigue con tu impulso de aprendizaje hoy.

# homePromptTitle
source: What plan should we craft next?
es: Que plan generamos hoy?

# homeInputHint
source: Example: Algebra in 7 days, conversational English...
es: Ejemplo: Algebra en 7 dias, ingles conversacional...

# homeSnackMissingTopic
source: Write a topic to continue
es: Escribe un tema para continuar

# homeGenerate
source: Generate AI learning plan
es: Generar plan con IA

# homeShortcuts
source: Shortcuts
es: Atajos

# homeShortcutCourse
source: Take a course
es: Toma un curso

# homeShortcutCourseSubtitle
source: AI generated micro-courses
es: Microcursos creados por IA

# homeShortcutLanguage
source: Learn a language
es: Aprende un idioma

# homeShortcutLanguageSubtitle
source: Vocabulary and practical grammar
es: Vocabulario y gramatica practica

# homeShortcutProblem
source: Solve a problem
es: Resuelve un problema

# homeShortcutProblemSubtitle
source: From question to guided plan
es: De la duda a un plan guiado

# startCalibration
source: Discover your level
es: Descubre tu nivel

source: Module 1 FREE
es: Modulo 1 GRATIS

source: Unlock Premium
es: Desbloquear Premium

# perMonth
source: /month
es: /mes

# gateQuizPassed
source: You passed! You can continue.
es: Aprobaste! Ya puedes continuar.

# gateQuizFailed
source: You need 70% to advance.
es: Necesitas 70% para avanzar.

# gateQuizReviewTopics
source: Review these topics:
es: Refuerza estos temas:

# gateQuizRetry
source: Try again
es: Volver a intentar

# gatePracticeUnlocked
source: Practice mode unlocked! Use these hints before retrying.
es: Modo práctica activado. Usa estas pistas antes de reintentar.

# gatePracticeLocked
source: Practice mode unlocks after 3 attempts. Keep going!
es: El modo práctica se activa tras 3 intentos. ¡Sigue!

# gatePracticeHintsTitle
source: Try these mini missions:
es: Pistas sugeridas:

# gatePracticeAttempts
source: Attempts used: {count}/{total}
es: Intentos usados: {count}/{total}

# modulePremiumContent
source: Premium content
es: Contenido premium

# modulePremiumUnlock
source: Unlock module {moduleNumber} by starting your free trial.
es: Desbloquea el modulo {moduleNumber} iniciando tu prueba gratis.

# modulePremiumButton
source: Unlock with Premium
es: Desbloquear con Premium

# moduleGatePending
source: Module quiz pending
es: Quiz de modulo pendiente

# moduleGateRequired
source: Pass the module {moduleNumber} quiz (>=70%) to advance.
es: Aprueba el quiz del modulo {moduleNumber} (>=70%) para avanzar.

# moduleGateTake
source: Take module quiz
es: Tomar quiz del modulo

# homeEnglishComingTitle
source: Early Access
es: Acceso Anticipado

# homeEnglishComingSubtitle
source: Be the first to try new features and suggest improvements
es: Sé el primero en probar nuevas funciones y sugerir mejoras

# homeEnglishNotifyCta
source: Notify me
es: Notificarme

# homeEnglishNotifyDone
source: Already registered
es: Ya registrado

# homeEnglishNotifySuccess
source: You'll be notified when Technical English launches!
es: ¡Te notificaremos cuando lance Inglés Técnico!

# homeEnglishNotifyError
source: Could not register notification
es: No se pudo registrar la notificación

# assessmentResultClose
source: Close
es: Cerrar

# assessmentResultResponsesTitle
source: Your answers
es: Tus respuestas

# settingsLanguageTitle
source: App Language
es: Idioma de la App

# settingsLanguageSpanish
source: Spanish
es: Español

# settingsLanguageEnglish
source: English
es: Inglés

# homeLogoutTooltip
source: Sign out
es: Cerrar sesion

# homeSignOutError
source: We could not sign you out. Try again.
es: No pudimos cerrar la sesion. Intenta de nuevo.

# homeUserFallback
source: Aelion user
es: Usuario Edaptia

# homeUserNoEmail
source: No email
es: Sin correo

# homeSuggestionMath
source: Math basics
es: Matematicas basicas

# homeSuggestionEnglish
source: Conversational English
es: Ingles conversacional

# homeSuggestionHistory
source: History of Rome
es: Historia de Roma

# homePrefillCourse
source: Quick Flutter course
es: Curso rapido de Flutter

# homePrefillLanguage
source: English in 1 month
es: Ingles en 1 mes

# homePrefillProblem
source: Solve integrals
es: Resolver integrales

# commonYes
source: Yes
es: Si

# onboardingTitle
source: Tell us about you
es: Cuentanos sobre ti

# onboardingSkip
source: Skip
es: Saltar

# onboardingProgressLabel
source: Question
es: Pregunta

# onboardingBack
source: Back
es: Anterior

# onboardingNext
source: Next
es: Siguiente

# onboardingStart
source: Start learning
es: Empezar

# onboardingSelectLabel
source: Select an option
es: Selecciona una opcion

# onboardingQuestionAge
source: What's your age range?
es: Cual es tu rango de edad?

# onboardingQuestionInterests
source: Which topics interest you?
es: Que temas te interesan?

# onboardingQuestionEducation
source: What's your education background?
es: Cual es tu nivel educativo?

# onboardingQuestionFirstSql
source: Is this your first time learning SQL?
es: Es tu primera vez con SQL?

# onboardingQuestionBeta
source: Do you want to be a beta tester?
es: Quieres ser beta tester?

# onboardingInterestData
source: Data analysis
es: Analisis de datos

# onboardingEducationSecondary
source: High school
es: Secundaria

# onboardingEducationUniversity
source: University
es: Universidad

# onboardingEducationPostgrad
source: Postgraduate
es: Posgrado

# onboardingEducationSelfTaught
source: Self-taught
es: Autodidacta

# onboardingBetaDescription
source: Edaptia is in active development. As a beta tester:\n• You get updates before everyone else\n• You unlock experimental features\n• Your feedback helps us improve
es: Edaptia esta en desarrollo activo. Como beta tester:\n• Recibiras actualizaciones antes que nadie\n• Tendras acceso a features experimentales\n• Tu feedback nos ayuda a mejorar

# onboardingBetaOptIn
source: Yes, I want to be a beta tester
es: Si, quiero ser beta tester

# onboardingError
source: We couldn't save your answers. Please try again.
es: No pudimos guardar tus respuestas. Intenta de nuevo.

# notFoundRoute
source: Route not found
es: Ruta no encontrada

# commonRetry
source: Retry
es: Reintentar

# dialogContinue
source: Continue
es: Continuar

# quizTitle
source: Placement quiz
es: Quiz de colocación

# quizHeaderTitle
source: Calibrate {topic}
es: Calibra {topic}

# quizIntroDescription
source: Take 10 quick questions to calibrate your plan.
es: Responde 10 preguntas rapidas para calibrar tu plan.

# startQuiz
source: Start
es: Comenzar

# quizQuestionCounter
source: Question {current} of {total}
es: Pregunta {current} de {total}

# quizTimeHint
source: Approx. {minutes} min
es: Aprox. {minutes} min

# quizAnswerAllPrompt
source: Answer every question before continuing.
es: Responde todas las preguntas antes de continuar.

# quizExitTitle
source: Leave quiz?
es: Salir del quiz?

# quizExitMessage
source: Your answers will be lost.
es: Perderas tus respuestas.

# quizExitCancel
source: Stay
es: Quedarme

# quizExitConfirm
source: Leave
es: Salir

source: Submit
es: Enviar

source: Next
es: Siguiente

# quizResultTitle
source: You are {band}
es: Nivel {band}

# quizLevelChip
source: Level: {band}
es: Nivel: {band}

# quizScorePercentage
source: Score: {score}%
es: Puntaje: {score}%

# quizRecommendRefine
source: We will refine your plan for the {band} level.
es: Refinaremos tu plan para el nivel {band}.

# quizKeepCurrentPlan
source: Your current plan already matches the {band} level.
es: Tu plan actual ya coincide con el nivel {band}.

# quizDone
source: Done
es: Listo

# quizNext
source: Next
es: Siguiente

# quizSubmit
source: Submit
es: Enviar

# quizContinue
source: Continue
es: Continuar

# quizUnknownError
source: We could not load the quiz. Try again.
es: No pudimos cargar el quiz. Intenta de nuevo.

# quizBandBeginner
source: Beginner
es: Principiante

# quizBandIntermediate
source: Intermediate
es: Intermedio

# quizBandAdvanced
source: Advanced
es: Avanzado

# courseEntryTitle
source: Take a course
es: Tomar un curso

# courseEntrySubtitle
source: Search a topic and launch a quick placement quiz.
es: Busca un tema y lanza un quiz de colocación rápido.

# courseEntryHint
source: Example: Flutter fundamentals, linear algebra, SQL...
es: Ejemplo: Fundamentos de Flutter, álgebra lineal, SQL...

# courseEntryStart
source: Start quiz
es: Iniciar quiz

# courseEntryFooter
source: We keep placement quizzes short (10 questions).
es: Los quizzes de colocación tienen solo 10 preguntas.

# courseEntryExampleFlutter
source: Intro to Flutter
es: Introducción a Flutter

# courseEntryExampleSql
source: SQL for beginners
es: SQL para principiantes

# courseEntryExampleDataScience
source: Data science 101
es: Ciencia de datos 101

# courseEntryExampleLogic
source: Logic fundamentals
es: Fundamentos de lógica

# courseEntryResultSummary
source: Score {score}% - level {band}
es: Puntaje {score}% - nivel {band}

# courseEntryResultActionUpdate
source: Generating a new outline for the {band} level.
es: Generando un nuevo plan para el nivel {band}.

# courseEntryResultActionReuse
source: Reusing your existing {band} plan.
es: Usando tu plan {band} ya existente.

# outlineFallbackTitle
source: Outline
es: Plan

# moduleOutlineFallbackTopic
source: Default topic
es: Tema predeterminado

# outlineUpdatePlan
source: Update plan
es: Actualizar plan

source: Refine plan
es: Refinar plan

# outlineRefineRebuild
source: New outline will match the {band} level.
es: El nuevo plan usará el nivel {band}.

# outlineRefineNoChanges
source: Current outline already matches the {band} level.
es: El plan actual ya corresponde al nivel {band}.

# outlineErrorGeneric
source: We could not load the outline.
es: No pudimos cargar el plan.

# outlineErrorEmpty
source: No outline available for this topic.
es: No hay un plan disponible para este tema.

# outlineErrorNoContent
source: No content available for this topic.
es: No hay contenido disponible para este tema.

# outlineSourceCached
source: Cached outline
es: Plan en caché

# outlineSavedLabel
source: Saved {timestamp}
es: Guardado {timestamp}

# outlineStaleBadge
source: Stale
es: Caducado

# outlineMetaBand
source: Level: {band}
es: Nivel: {band}

# outlineMetaLevel
source: Level: {level}
es: Nivel: {level}

# outlineMetaHours
source: {hours} hours
es: {hours} horas

# outlineMetaLanguage
source: Language: {language}
es: Idioma: {language}

# outlineMetaDepth
source: Depth: {depth}
es: Profundidad: {depth}

# outlineLessonCount
source: {count} lessons
es: {count} lecciones

# outlineLessonLanguage
source: Language: {language}
es: Idioma: {language}

# outlineModuleFallback
source: Module {index}
es: Módulo {index}

# outlineLessonFallback
source: Lesson {index}
es: Lección {index}

# homeGreetingNamed
source: Hi {name}, what do you want to learn today?
es: Hola {name}, ¿qué quieres aprender hoy?

# homeRecentTitle
source: Recent plans
es: Planes recientes

# homeRecentEmpty
source: You have no saved plans yet.
es: Aún no tienes planes guardados.

# homeRecentView
source: View outline
es: Ver plan

# homeRecentMoreCount
source: +{count} more modules
es: +{count} módulos más

# homeRecentSaved
source: Saved {timestamp}
es: Guardado {timestamp}

# homeDepthIntro
source: Intro level
es: Nivel introductorio

# homeDepthMedium
source: Intermediate depth
es: Profundidad intermedia

# homeDepthDeep
source: Deep dive
es: Profundidad avanzada

# homeUpdatedJustNow
source: Updated just now
es: Actualizado hace un instante

# homeUpdatedMinutes
source: Updated {minutes} min ago
es: Actualizado hace {minutes} min

# homeUpdatedHours
source: Updated {hours} h ago
es: Actualizado hace {hours} h

# homeUpdatedDays
source: Updated {days} d ago
es: Actualizado hace {days} d

# outlineRefineChangeDepthTitle
source: Change depth
es: Cambiar profundidad

# outlineRefineChangeDepthSubtitle
source: Reuse or generate outlines for intro, medium, or deep levels.
es: Reutiliza o genera planes para niveles intro, intermedio o profundo.

source: Take placement quiz
es: Tomar quiz de colocación

# outlineRefinePlacementQuizSubtitle
source: Answer 10 questions to calibrate your plan.
es: Responde 10 preguntas para calibrar tu plan.

# outlineSnackCached
source: Loaded your saved plan.
es: Se cargo tu plan guardado.

# outlineSnackUpdated
source: Plan ready with the latest updates.
es: Plan actualizado con los ultimos cambios.

# buildExpertiseIn
source: Build expertise in {topic}
es: Desarrolla experiencia en {topic}

# depthIntro
source: introductory
es: introductoria

# depthMedium
source: intermediate
es: intermedia

# depthDeep
source: advanced
es: profunda

# calibratingPlan
source: Calibrating your plan
es: Calibrando tu plan

source: Plan ready
es: Plan creado

# homeRecommendationsTitle
source: Recommended
es: Recomendados

# homeRecommendationsEmpty
source: No recommendations yet.
es: Sin recomendaciones por ahora.

# homeRecommendationsError
source: We could not load recommendations.
es: No pudimos cargar las recomendaciones.

# quizCooldownMinutes
source: Please wait {minutes} more minute(s) before retaking the quiz.
es: Espera {minutes} minuto(s) antes de rehacer el quiz.

# quizCooldownSeconds
source: Please wait a few seconds before retaking the quiz.
es: Espera unos segundos antes de rehacer el quiz.

# quizOpenPlan
source: Open plan
es: Abrir plan

# quizApplyResults
source: Apply results
es: Aplicar resultados

# quizResultsNoChanges
source: Results saved without changes.
es: Resultados guardados sin cambios.

# planAlreadyAligned
source: Your plan is already aligned.
es: Tu plan ya está alineado.

# lessonCompleteToast
source: Lesson completed! XP total: {xp}
es: ¡Lección completada! XP total: {xp}

# lessonUpdateError
source: We couldn't update the lesson. Try again.
es: No pudimos actualizar la lección. Intenta de nuevo.

# lessonPremiumContent
source: Premium content
es: Contenido premium

# lessonDescriptionTitle
source: Description
es: Descripción

# lessonMarkCompleted
source: Mark lesson as completed
es: Marcar lección como completada

# lessonTipTakeNotes
source: Tip: take quick notes before moving on.
es: Consejo: toma notas rápidas antes de continuar.

# lessonFallbackTitle
source: Lesson
es: Lección

# lessonObjectiveTitle
source: Lesson objective
es: Objetivo de la lección

# lessonObjectiveSummary
source: • Understand the core concept. • Complete a short practice. • Move on once you feel ready.
es: • Comprende el concepto principal. • Realiza una práctica breve. • Avanza cuando te sientas listo.

# lessonQuizTitle
source: Question
es: Pregunta

# lessonQuizCheck
source: Check answer
es: Comprobar respuesta

# lessonQuizCorrect
source: ✅ Correct!
es: ✅ ¡Correcto!

# lessonQuizIncorrect
source: ❌ Incorrect. The answer was {answer}.
es: ❌ Incorrecto. La respuesta era {answer}.

# lessonTipReview
source: Tip: if something is unclear, reread and practice for 2 more minutes before moving on.
es: Consejo: si algo no queda claro, vuelve a leer y practica 2 minutos más antes de avanzar.

# lessonContentComingSoon
source: Content available soon.
es: Contenido disponible pronto.

# commonOk
source: OK
es: Aceptar

# commonSaving
source: Saving...
es: Guardando...

# homeGenerateError
source: We could not generate the plan. Try again.
es: No pudimos generar el plan. Intenta de nuevo.

# topicSearchMissingTopic
source: Type a topic to continue
es: Escribe un tema para continuar

# topicSearchTitleFallback
source: Search a topic
es: Buscar un tema

# topicSearchHintFallback
source: What do you want to learn?
es: ¿Qué quieres aprender?

# topicSearchStartButton
source: Take mini quiz
es: Tomar mini quiz

# quizPlanCreated
source: Plan created.
es: Plan creado.

# helpSupportTitle
source: Help & Support
es: Ayuda y soporte

# helpSupportSubtitle
source: Answers, contact options, and community links.
es: Respuestas, formas de contacto y enlaces a la comunidad.

# helpFaqSectionTitle
source: Frequently asked questions
es: Preguntas frecuentes

# helpCommunitySectionTitle
source: Community
es: Comunidad

# helpContactSectionTitle
source: Contact options
es: Opciones de contacto

# helpJoinCommunity
source: Join Community
es: Unirte a la comunidad

# helpJoinCommunityDescription
source: Choose how you want to connect with other learners.
es: Elige cómo conectarte con otros estudiantes.

# helpJoinCommunityDialogTitle
source: Open Telegram
es: Abrir Telegram

# helpJoinCommunityChannel
source: News channel
es: Canal de noticias

# helpJoinCommunityGroup
source: Community chat
es: Chat de la comunidad

# helpContactSpanish
source: Email support (ES)
es: Correo de soporte (ES)

# helpContactSpanishDescription
source: Reach our Spanish-speaking agents.
es: Escríbenos en español; respondemos rápido.

# helpContactEnglish
source: Email support (EN)
es: Correo de soporte (EN)

# helpContactEnglishDescription
source: Get help in English from the core team.
es: Recibe ayuda en inglés del equipo principal.

# helpReportBug
source: Report a bug
es: Reportar un error

# helpReportBugDescription
source: Include screenshots or steps if possible.
es: Incluye capturas o pasos si es posible.

# helpAboutTitle
source: About this app
es: Acerca de esta app

# helpAboutDescription
source: Built with Flutter and Firebase; all content is generated via secure Cloud Functions.
es: Creada con Flutter y Firebase; todo el contenido se genera mediante Cloud Functions seguras.

# helpPrivacyPolicy
source: Privacy Policy
es: Política de privacidad

# helpTermsOfService
source: Terms of Service
es: Términos de servicio

# helpLaunchError
source: We couldn't open the link. Please try again.
es: No pudimos abrir el enlace. Intenta de nuevo.

# homeOverflowHelpSupport
source: Help & Support
es: Ayuda y soporte

# settingsTitle
source: Settings
es: Configuración

# settingsHelpSupport
source: Help & Support
es: Ayuda y soporte

# settingsHelpSupportSubtitle
source: FAQs, contact, and policies
es: Preguntas, contacto y políticas

# helpEmailSubject
source: {appName} support request (v{version} · {device})
es: Solicitud de soporte {appName} (v{version} · {device})

# helpBugReportSubject
source: {appName} bug report (v{version} · {device})
es: Reporte de bug {appName} (v{version} · {device})

# helpBugReportBody
source: Timestamp: {timestamp} Locale: {locale} Version: {version} Device: {device} Steps to reproduce: -
es: Marca de tiempo: {timestamp} Localización: {locale} Versión: {version} Dispositivo: {device} Pasos para reproducir: -

# helpAboutVersion
source: Version {version}
es: Versión {version}

# helpFaqQuestion1
source: How do I generate my first learning plan?
es: ¿Cómo genero mi primer plan de aprendizaje?

# helpFaqAnswer1
source: On the Home screen, enter a topic and tap Generate AI learning plan.
es: En la pantalla Inicio, escribe un tema y toca Generar plan con IA.

# helpFaqQuestion2
source: Where can I find my recent outlines?
es: ¿Dónde encuentro mis planes recientes?

# helpFaqAnswer2
source: Scroll to the Recents section on Home; each card reopens the saved outline instantly.
es: Desplázate a Recientes en Inicio; cada tarjeta abre el plan guardado.

# helpFaqQuestion3
source: How are trending topics selected?
es: ¿Cómo se eligen los temas en tendencia?

# helpFaqAnswer3
source: We mix your latest searches with popular requests in your language to suggest new ideas.
es: Combinamos tus últimas búsquedas con solicitudes populares en tu idioma.

# helpFaqQuestion4
source: What is a placement quiz?
es: ¿Qué es un quiz de colocación?

# helpFaqAnswer4
source: It is a 10-question calibration that sets the right level before we build a tailored plan.
es: Es una calibración de 10 preguntas que define el nivel adecuado antes del plan.

# helpFaqQuestion5
source: Can I change the depth of a plan later?
es: ¿Puedo cambiar la profundidad del plan después?

# helpFaqAnswer5
source: Open the outline, tap Refine plan, and select the depth that matches your goal.
es: Abre el plan, toca Refinar plan y elige la profundidad que se ajuste a tu meta.

# helpFaqQuestion6
source: How do I switch the outline language?
es: ¿Cómo cambio el idioma del plan?

# helpFaqAnswer6
source: Generate again after choosing your preferred language in the quiz or topic prompt.
es: Genera nuevamente tras elegir tu idioma preferido en el quiz o en el prompt.

# helpFaqQuestion7
source: What happens if I lose connection?
es: ¿Qué sucede si pierdo la conexión?

# helpFaqAnswer7
source: Cached outlines and recents stay available offline; new generations wait until you are online.
es: Los planes y recientes en caché siguen disponibles; las nuevas generaciones esperan a que vuelvas a estar en línea.

# helpFaqQuestion8
source: How is my progress saved?
es: ¿Cómo se guarda mi progreso?

# helpFaqAnswer8
source: Metadata and cached outlines are stored securely on your device via SharedPreferences.
es: Guardamos metadatos y planes en caché de forma segura en tu dispositivo con SharedPreferences.

# helpFaqQuestion9
source: How do I sign out safely?
es: ¿Cómo cierro sesión de forma segura?

# helpFaqAnswer9
source: Use the logout icon on the Home app bar; it signs you out of Firebase and Google on mobile.
es: Usa el icono de salida en la barra superior; cierra sesión en Firebase y en Google en móviles.

# helpFaqQuestion10
source: How do I switch Google accounts?
es: ¿Cómo cambio de cuenta de Google?

# helpFaqAnswer10
source: Sign out first, then pick the other account when the Google sign-in sheet appears.
es: Cierra sesión y elige la otra cuenta cuando aparezca la hoja de inicio de sesión de Google.

# helpFaqQuestion11
source: How can I clear my recent searches?
es: ¿Cómo borro mis búsquedas recientes?

# helpFaqAnswer11
source: Search history is capped to the latest entries per account and is cleared automatically when you sign out.
es: El historial se limita a las últimas entradas por cuenta y se limpia automáticamente al cerrar sesión.

# helpFaqQuestion12
source: What data do you store in Firestore?
es: ¿Qué datos guardan en Firestore?

# helpFaqAnswer12
source: Only anonymized outline cache entries and observability metrics generated by Cloud Functions.
es: Solo registros anonimizados de planes en caché y métricas de observabilidad creadas por Functions.

# helpFaqQuestion13
source: How do I report incorrect content?
es: ¿Cómo reporto contenido incorrecto?
