Repository: Carlosjc97/aelion
Catalog: lib/l10n/app_*.arb
Languages: es

# helpFaqAnswer13
source: Use the Report a bug button below and describe what needs to be fixed.
es: Usa el botón Reportar un error y describe lo que debemos corregir.

# helpFaqQuestion14
source: Where do recommendations come from?
es: ¿De dónde salen las recomendaciones?

# helpFaqAnswer14
source: They combine aggregated demand with your recent activity to surface relevant topics.
es: Mezclan demanda agregada con tu actividad reciente para mostrar temas relevantes.

# helpFaqQuestion15
source: Can I regenerate a plan after finishing a quiz?
es: ¿Puedo regenerar un plan después del quiz?

# helpFaqAnswer15
source: Yes. Applying quiz results automatically rebuilds the outline with the new band.
es: Sí. Al aplicar los resultados se reconstruye el plan con el nuevo nivel.

# helpFaqQuestion16
source: How long are cached outlines kept?
es: ¿Cuánto tiempo se conservan los planes en caché?

# helpFaqAnswer16
source: They remain until you replace them or clear storage; stale badges appear after 24 hours.
es: Permanecen hasta que los reemplazas o borras la memoria; la etiqueta Caducado aparece tras 24 horas.

# helpFaqQuestion17
source: Why was I asked to retake the quiz?
es: ¿Por qué me piden rehacer el quiz?

# helpFaqAnswer17
source: We prompt a retake when your level looks outdated or the cache exceeded its freshness window.
es: Lo sugerimos cuando tu nivel parece desactualizado o la caché supera su ventana de vigencia.

# helpFaqQuestion18
source: Can I use the app on multiple devices?
es: ¿Puedo usar la app en varios dispositivos?

# helpFaqAnswer18
source: Yes. Sign in with the same Google account on web or Android to stay in sync.
es: Sí. Inicia sesión con la misma cuenta de Google en web o Android para mantener la sincronización.

# helpFaqQuestion19
source: Does the app support dark mode?
es: ¿La app soporta modo oscuro?

# helpFaqAnswer19
source: The interface follows your system theme and keeps contrast within accessibility guidelines.
es: Seguimos el tema del sistema y mantenemos el contraste dentro de las guías de accesibilidad.

# helpFaqQuestion20
source: How do I reset my learning streak?
es: ¿Cómo reinicio mi racha de aprendizaje?

# helpFaqAnswer20
source: Clear local data from system settings or sign in with a new account.
es: Borra los datos locales desde los ajustes del sistema o inicia sesión con una cuenta nueva.

# helpFaqQuestion21
source: How can I request a new feature?
es: ¿Cómo solicito una nueva función?

# helpFaqAnswer21
source: Send your idea through the English support email and include Feature idea in the message.
es: Envía tu idea por el correo de soporte en inglés y añade 'Feature idea' en el mensaje.

# helpFaqQuestion22
source: Do I need an account to use the app?
es: ¿Necesito una cuenta para usar la app?

# helpFaqAnswer22
source: Yes, Google authentication protects your content and enables personalization.
es: Sí, usamos autenticación de Google para proteger tu contenido y personalización.

# helpFaqQuestion23
source: What happens if I close the app during a quiz?
es: ¿Qué pasa si cierro la app durante un quiz?

# helpFaqAnswer23
source: You can restart the quiz anytime; progress resets to keep the calibration accurate.
es: Puedes reiniciar el quiz cuando quieras; el progreso se reinicia para calibrar correctamente.

# helpFaqQuestion24
source: How do I delete cached outlines?
es: ¿Cómo elimino los planes en caché?

# helpFaqAnswer24
source: Cached outlines live only on your device; uninstalling or clearing the app data removes them.
es: Los planes en caché viven en tu dispositivo; desinstala o borra los datos de la app para quitarlos.

# helpFaqQuestion25
source: Is my personal data shared with third parties?
es: ¿Comparten mis datos personales con terceros?

# helpFaqAnswer25
source: No. We only use aggregate telemetry for reliability and never sell personal information.
es: No. Solo usamos telemetría agregada para confiabilidad y nunca vendemos información personal.

# helpFaqQuestion26
source: Can I use the app without Firebase Functions?
es: ¿Puedo usar la app sin Firebase Functions?

# helpFaqAnswer26
source: No. Direct Firestore access is blocked; all requests go through secure HTTPS Functions.
es: No. El acceso directo a Firestore está bloqueado; todas las solicitudes pasan por Functions seguras.

# helpFaqQuestion27
source: Why do I see a stale badge?
es: ¿Por qué veo la etiqueta Caducado?

# helpFaqAnswer27
source: It means the cached outline is older than the freshness threshold and should be regenerated.
es: Indica que el plan en caché pasó el umbral de frescura y conviene regenerarlo.

# helpFaqQuestion28
source: How do I join the community?
es: ¿Cómo me uno a la comunidad?

# helpFaqAnswer28
source: Tap Join Community to open the Telegram news channel or chat group.
es: Toca Unirte a la comunidad para abrir el canal o el chat en Telegram.

# helpFaqQuestion29
source: How do I check the app version?
es: ¿Cómo reviso la versión de la app?

# helpFaqAnswer29
source: Open Help & Support and scroll to About; the version number is listed there.
es: Abre Ayuda y soporte y desplázate a Acerca de; ahí verás el número de versión.

# helpFaqQuestion30
source: Can I run the app with local emulators?
es: ¿Puedo ejecutar la app con emuladores locales?

# helpFaqAnswer30
source: Yes. Set USE_FUNCTIONS_EMULATOR=true in env.public and start the Firebase emulators.
es: Sí. Ajusta USE_FUNCTIONS_EMULATOR=true en env.public y arranca los emuladores de Firebase.

# helpFaqQuestion31
source: How do I contact support in Spanish?
es: ¿Cómo contacto soporte en español?

# helpFaqAnswer31
source: Use the Spanish email button; it routes directly to our Spanish-speaking support team.
es: Usa el botón de correo en español; llega directo a nuestro equipo hispanohablante.

# helpFaqQuestion32
source: How quickly does support respond?
es: ¿Cuánto tardan en responder?

# helpFaqAnswer32
source: We aim to reply within one business day and usually respond much sooner.
es: Buscamos responder en un día hábil y normalmente lo hacemos antes.

# helpFaqQuestion33
source: What details help with a bug report?
es: ¿Qué datos ayudan en un reporte de errores?

# helpFaqAnswer33
source: Include the timestamp, locale, app version, device, and clear reproduction steps.
es: Incluye la marca de tiempo, tu localidad, versión de la app, dispositivo y pasos para reproducir.

# helpFaqQuestion34
source: How do I get the latest release?
es: ¿Cómo obtengo la versión más reciente?

# helpFaqAnswer34
source: Install updates from your app store or pull the main branch if you are contributing.
es: Actualiza desde tu tienda de apps o haz pull de la rama main si contribuyes al proyecto.

# helpFaqQuestion35
source: Where can I read the privacy policy and terms?
es: ¿Dónde leo la política de privacidad y los términos?

# helpFaqAnswer35
source: Use the Privacy Policy and Terms of Service links in the About section.
es: Sigue los enlaces de Política de privacidad y Términos de servicio en la sección Acerca de.

# adaptiveFlowCta
source: Adaptive flow
es: Flujo adaptativo

# adaptiveFlowTitle
source: Adaptive journey
es: Recorrido adaptativo

# adaptiveFlowLoading
source: Loading adaptive plan...
es: Cargando plan adaptativo...

# adaptiveFlowError
source: We couldn't load the adaptive plan. Try again.
es: No pudimos cargar el plan adaptativo. Intenta de nuevo.

# adaptiveFlowNoPlan
source: No adaptive plan yet. Generate one to get started.
es: Aún no tienes plan adaptativo. Généralo para comenzar.

# adaptiveFlowLearnerState
source: Learner state
es: Estado del alumno

# adaptiveFlowPlanSection
source: Suggested modules
es: Módulos sugeridos

# adaptiveFlowModuleSection
source: Module
es: Módulo

# adaptiveFlowBoosterSection
source: Booster
es: Refuerzo

# adaptiveFlowGenerateModule
source: Generate module
es: Generar módulo

# adaptiveFlowGenerateCheckpoint
source: Create checkpoint
es: Crear checkpoint

# adaptiveFlowSubmitAnswers
source: Evaluate checkpoint
es: Evaluar checkpoint

# adaptiveFlowBoosterCta
source: Request booster
es: Pedir refuerzo

# adaptiveFlowWeakSkills
source: Weak skills: {skills}
es: Habilidades débiles: {skills}

# adaptiveFlowScoreLabel
source: Score: {score}%
es: Puntaje: {score}%

# adaptiveFlowActionAdvance
source: Great! Advance to the next module.
es: ¡Genial! Avanza al siguiente módulo.

# adaptiveFlowActionBooster
source: Booster recommended before moving on.
es: Necesitas un refuerzo antes de avanzar.

# adaptiveFlowActionReplan
source: Repeating this module with more scaffolding.
es: Repite este módulo con más andamiaje.

# adaptiveFlowCheckpointMissingSelection
source: Select an answer for each question.
es: Selecciona una respuesta por pregunta.

# adaptiveFlowEmptySkills
source: No skills tracked yet.
es: Aún no hay dominio registrado.

# adaptiveFlowDurationLabel
source: Duration: {minutes} min
es: Duración: {minutes} min

# adaptiveFlowSkillsLabel
source: Skills: {skills}
es: Habilidades: {skills}

# adaptiveFlowLockedModule
source: Complete module {module} to unlock this one.
es: Completa el módulo {module} para desbloquearlo.

# adaptiveFlowLockedPremium
source: Unlock Premium to keep advancing.
es: Activa Premium para seguir avanzando.

# assessmentResultTitle
source: Your level: {level}
es: Tu nivel: {level}

# assessmentResultStrengthsTitle
source: Strengths
es: Fortalezas

# assessmentResultGapsTitle
source: Areas to improve
es: Áreas de mejora

# assessmentResultShare
source: Share results
es: Compartir resultados

# assessmentResultCta
source: Generate my learning plan
es: Generar mi plan de aprendizaje

# assessmentResultLevelLabel
source: Detected level: {level}
es: Nivel detectado: {level}

# assessmentResultPercentile
source: You scored better than {percentile}% of learners
es: Obtuviste mejor puntaje que el {percentile}% de los aprendices

# assessmentResultPlanTitle
source: Suggested plan
es: Plan sugerido

# assessmentResultShareMessage
source: I just completed my {topic} assessment on Edaptia! Level: {level}, Score: {score}%
es: ¡Acabo de completar mi evaluación de {topic} en Edaptia! Nivel: {level}, Puntuación: {score}%
